Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/children_and_young_offenders/detention_of_children_and_young_people.html.txt.tmx
Source language: en
Languages: ga

source: Children between the ages of 10 and 16 sentenced by the courts to a period of detention are sent to the Oberstown Children Detention Campus
ga: Má tá tú idir 10 agus 17 bliain d’aois, is féidir leis na cúirteanna thú a chur chuig roinnt institiúidí de chineálacha éagsúla

source: People aged 18 years or over may be sent to prison
ga: Is féidir daoine atá 18 mbliana nó níos sine a chur chun príosúin

source: Former Industrial Schools and Reformatory Schools were called children detention schools and were managed by the Irish Youth Justice Service which is part of the Department of Children and Youth Affairs
ga: Tugtar scoileanna coinneála leanaí ar na hiar-Scoileanna Tionsclaíocha agus Scoileanna Ceartúcháin anois agus déanann Seirbhís na hÉireann um Cheartas i leith an Aosa Óig, atá mar chuid den Roinn Leanaí agus Gnóthaí Óige, iad a bhainistiú

source: There were 3 children detention schools which were considered suitable to detain remanded and committed children
ga: IBhí ann do 3 scoil choinneála leanaí a bhí measadh gurb oiriúnach iad do leanaí athchurtha agus cimithe a choinneáil

source: Male offenders aged 16 to 21 were also sent to places of detention instead of prison. The main place of detention was St
ga: Tá áiteanna coinneála do chiontóirí idir aois 16 agus 21 bliain d’aois a chuirtear ansin seachas an príosún

source: Partick's Institution, which was formerly known as Borstal and took male offenders between the ages of 16 and 21. St. Patrick's Institution was closed on 7 April 2017
ga: Bhí Institiúid Naomh Pádraig an phríomháit choinneála ar ar tugadh Borstal go foirmiúil agus glach sí le ciontóirí fireanna idir aois 16 agus 21 bliain

source: A new national children detention facility for children under the age of 18 has been developed at Oberstown
ga: Tá náisiúnta áis coinneála leanaí á forbairt do leanaí faoi aois 18 mbliana ag Baile an Oibricigh

source: Since June 2016, the 3 detention schools listed above have been amalgamated to form the Oberstown Children Detention Campus
ga: Ó Mheitheamh 2016, tá an 3 scoil coinneála atá luaite thuas, cónasctha chun aon scoil choinneála leanaí ar a dtugtar an Campas Coinneála Leanaí Bhaile an Oibricigh

source: Girls and boys from the age of 10 and up to the age of 18 sentenced to a period of detention by the courts are now detained at the Oberstown campus
ga: Cailíní ó aois 10 agus suas go dtí 18 bliana d'aois, agus buachaillí ó aois 10 agus suas go dtí 17 mbliana d'aois atá faoi choinneáil ar champas Bhaile an Oibricigh
